#include<stdio.h>

int main(){
    int a,i,j,k,l;
    scanf("%d",&a);
    for (i = 1; i <= a; i++)
    {
        for (j = 1; j <= 2*a-1; j++)
        {
           if (j<=i|| j>=2*a-i)
           {
            printf("*");
           }
           else
           {
            printf(" ");
           }
        }
        printf("\n");
    }
    for (i = a-1; i >= 1; i--)
    {
        for (j = 2*a-1; j >= 1; j--)
        {
            if (j<=i|| j>=2*a-i)
            {
                printf("*");
            }
           else
           {
            printf(" ");
           }
        }
        printf("\n");
    }
    
return 0;
}

// 1.รับค่าเก็บใน a
// 2.i=1
// 3.ทำซ้ำโดยเพิ่มค่า i เมื่อ i<=a
//     1.j=1
//     2.ทำซ้ำโดยเพิ่มค่า j เมื่อ j<=2*a-1
//         1.ถ้า j<=1 หรือ j>=2*a-1
//             1.แสดงผล *
//         2.ถ้าไม่ใช่
//             1.แสดงผลช่องว่าง
//     3.แสดงผลNew line 
// 4.i=a-1
// 5.ทำซ้ำโดยลดค่า i เมื่อ i>=1
//     1.j=2*a-1
//     2.ทำซ้ำโดยลดค่า j เมื่อ j>=1
//         1.ถ้า j<=1 หรือ j>=2*a-1
//             1.แสดงผล *
//         2.ถ้าไม่ใช่
//             1.แสดงผลช่องว่าง
//     3.แสดงผลNew line